# config.py

TOKEN = "8797929122:AAEtdauvZ0sE0Srn0Png1y-07OW9u8psodk"

# آیدی عددی ادمین
ADMIN_ID = 6629601076

# تعداد خبرهایی که نمایش داده میشه
NEWS_COUNT = 5

# API اخبار کریپتو
GNEWS_API_KEY = "pub_35084e7242cd481cb59ac27ab88a5032"

# متن درباره من
ABOUT_TEXT = """
👋 سلام، من سجاد هستم.

📊 در حوزه بازارهای مالی، تحلیل تکنیکال، تحلیل فاندامنتال و ارزهای دیجیتال فعالیت و مطالعه می‌کنم.

💻 در کنار مباحث مالی، در زمینه برنامه‌نویسی پایتون، توسعه ربات‌های تلگرام، طراحی وب‌سایت و ابزارهای دیجیتال مشغول یادگیری و اجرای پروژه‌های مختلف هستم.

🤖 همچنین به فناوری‌های هوش مصنوعی و کاربردهای آن در کسب‌وکار و تولید محتوا علاقه‌مندم و به‌صورت مستمر این حوزه را دنبال می‌کنم.

🎯 هدف من توسعه مهارت‌های تخصصی، ساخت پروژه‌های کاربردی و ایجاد کسب‌وکارهای ارزشمند در فضای دیجیتال است.

━━━━━━━━━━━━━━━

📬 تلگرام شخصی:
@SAJJAD_EWS

📢 کانال تلگرام:
@SADSSCS

📢 کانال ایتا:
@SADSSCS

📢 کانال سروش:
@SADSSCS

━━━━━━━━━━━━━━━

از همراهی شما سپاسگزارم ❤️
"""

CONTACT_TEXT = """
📩 پیام خود را ارسال کنید.

شما می‌توانید متن، عکس، ویدیو، ویس، فایل، استیکر و سایر محتواها را ارسال کنید.

پیام شما مستقیماً برای مدیر ربات ارسال خواهد شد.
"""

SERVICES_TEXT = """
🛠 خدمات ربات

یکی از گزینه‌های زیر را انتخاب کنید.
"""